import 'dataModel.dart';

Map photoSlider = {
  "slider-1": "assets/img/homeSlider/slider.webp",
  "slider-2":
      "https://www.mbusa.com/content/dam/mb-nafta/ca/myco/my23/eqb-suv/gallery/series/gallery-class/2023-EQB-SUV-GAL-004-XL.jpg"
};

List<CarsModel> carsList = [
  CarsModel(
    nameCarFA: "اس ال",
    nameCarEN: "AMG-SL",
    classCar: "کوپه",
    imgCar: "assets/img/AMG-SL/silver.webp",
    imgCarPNG: "assets/img/AMG-SL/silver.png",
    btnRedmore: 'مشاهده',
    speed: "350",
    power: "469 اسب بخار",
    cityFuelEconomy: "14 mpg",
    highwayFuelEconomy: "21 mpg",
    acceleration: "3.8 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my22/sl/class-page/amg/2022-SL-ROADSTER-CT-4-2-DR.mp4",
    passengerCapacity: "4 نفره",
    engin: "3982",
    options: """
1. سیستم صوتی Burmester
2. سیستم هوشمند ناوبری
3. سیستم پارکینگ خودکار
4. سیستم هشدار تصادف و جلوگیری از تصادف
5. سیستم تهویه خودکار دو منطقه ای
6. سیستم گرم کننده هوای داخلی
7. صندلی های گرمکن و خنک کننده
8. سیستم تهویه خودکار صندوق عقب
9. سیستم کنترل سرعت
10. دوربین 360 درجه
11. شیشه های جلو تیره شده
12. سیستم هشدار ترک خط
13. سیستم تشخیص تابعیت خط
14. سیستم تشخیص علائم راهنمایی ترافیک
15. سیستم تشخیص راننده خسته
16. سیستم ردیابی نقطه کور
17. سیستم توقف اضطراری
18. سیستم تشخیص پیشرفته تصادف
19. سیستم تبدیل میله کنترل به چرم
20. دیسک های ترمز کربن کرمیت
21. سیستم تنظیم الکترونیکی تعلیق.

لطفا توجه داشته باشید که این لیست به عنوان یک مثال از اپشن‌های ممکن مرسدس بنز SL ذکر شده است و هر مدل و نسخه از این خودرو ممکن است دارای اپشن های متفاوتی باشد.
""",
    articleCar: """
مرسدس بنز SL یک خودروی لوکس تورینگ است که از سال 1954 تولید شده است. SL مخفف "Sport Leicht" است که در انگلیسی به "Sport Light" ترجمه می شود. این خودرو کانورتیبل دو سرنشینه است و یکی از محبوب ترین مدل های خط تولید مرسدس بنز بوده است.

در طول سال ها، SL چندین نسل و طراحی مجدد را پشت سر گذاشته است و آخرین مدل که در سال 2021 معرفی شد، نسل هفتم است. مرسدس بنز SL 2021 یک طراحی کاملا جدید است و بر روی پلت فرم جدیدی ساخته شده است. بلندتر، عریض‌تر و پایین‌تر از مدل قبلی خود است و دارای طراحی تهاجمی‌تر با خطوط تیزتر و حالت عضلانی‌تر است.

مرسدس بنز SL 2021 در چندین گزینه موتور موجود است، از جمله موتور 3.0 لیتری شش سیلندر خطی با توربوشارژر که 429 اسب بخار قدرت و 384 پوند فوت گشتاور تولید می کند، و موتور 4.0 لیتری V8 با توربوشارژر دوقلو. که 577 اسب بخار قدرت و 516 پوند فوت گشتاور تولید می کند. هر دو موتور به گیربکس 9 سرعته اتوماتیک متصل شده اند و به صورت استاندارد با دیفرانسیل عقب عرضه می شوند.

از نظر ویژگی‌ها، مرسدس بنز SL 2021 با طیف وسیعی از فناوری‌های پیشرفته از جمله مجموعه ابزار کاملا دیجیتال، صفحه نمایش 12.3 اینچی اطلاعات سرگرمی با Apple CarPlay و Android Auto، سیستم صوتی Burmester، سیستم دوربین 360 درجه ارائه می‌شود. و مجموعه ای از ویژگی های ایمنی پیشرفته مانند کروز کنترل تطبیقی، هشدار خروج از خط، و ترمز اضطراری خودکار.

به طور کلی، مرسدس بنز SL یک خودروی بزرگ تورینگ مجلل و قدرتمند است که تجربه رانندگی هیجان انگیز و طیف وسیعی از ویژگی ها و فناوری های پیشرفته را ارائه می دهد.

1. تاریخچه: مرسدس بنز SL برای اولین بار در سال 1954 با نام 300 SL معرفی شد که یک خودروی مسابقه ای بود که درهای بال مرغان داشت. در سال 1957، 300 SL رودستر معرفی شد که اولین SL با درهای معمولی بود. از آن زمان، SL دستخوش چندین بازطراحی شده و به یکی از نمادین ترین مدل های خط تولید مرسدس بنز تبدیل شده است.

2. طراحی: مرسدس بنز SL همیشه به خاطر طراحی شیک و اسپرتش معروف بوده است. جدیدترین مدل دارای کاپوت بلند، عرشه عقب کوتاه و سقف سخت جمع شونده است که می تواند تا سرعت 25 مایل در ساعت کار کند. طراحی بیرونی با یک فضای داخلی مجلل و با تکنولوژی بالا که دارای مواد درجه یک و فناوری های پیشرفته است تکمیل می شود.

3. عملکرد: مرسدس بنز SL به عملکرد قدرتمند و پویا معروف است. آخرین مدل با طیف وسیعی از موتورها، از جمله یک موتور 3.0 لیتری شش سیلندر خطی و یک موتور 4.0 لیتری V8 در دسترس است که هر دو با یک گیربکس 9 سرعته اتوماتیک جفت می شوند. SL همچنین دارای طیف وسیعی از فناوری‌های عملکردی پیشرفته، مانند سیستم تعلیق تطبیقی ​​و فرمان چرخ‌های عقب فعال است که هندلینگ و پایداری را افزایش می‌دهد.

4. ویژگی ها: مرسدس بنز SL دارای ویژگی ها و فناوری های پیشرفته ای است که راحتی، راحتی و ایمنی را افزایش می دهد. برخی از ویژگی های موجود در جدیدترین مدل عبارتند از: سیستم صوتی Burmester، صفحه نمایش اطلاعات سرگرمی 12.3 اینچی، شارژ بی سیم، نمایشگر هد آپ، صندلی های گرم شونده و تهویه شونده، و مجموعه ای از ویژگی های ایمنی پیشرفته مانند نظارت بر نقاط کور و هشدار خروج از خط.
""",
    id: "1",
  ),
  CarsModel(
    nameCarFA: "جی کلاس",
    nameCarEN: "G-class",
    classCar: "شاسی بلند",
    imgCar: "assets/img/G-class/2022-G550-SUV-AVP-DR.webp",
    imgCarPNG: "assets/img/G-class/2022-G550-SUV-AVP-DR.png",
    btnRedmore: "مشاهده",
    speed: "240",
    power: "416 hp",
    cityFuelEconomy: "13 mpg",
    highwayFuelEconomy: "16 mpg",
    acceleration: "5.6 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my23/g/class-page/series/2023-G-SUV-CT-2-2-DR.mp4",
    passengerCapacity: "5 نفره",
    engin: "2925",
    options: """
1. سقف شیشه‌ای برقی
2. سیستم صوتی Burmester
3. پنجره‌های جانبی چندلایه
4. سیستم پارکینگ خودکار
5. سیستم هوشمند فرمان
6. سیستم هشدار تصادف با پیاده‌رو
7. سیستم اطلاعات راننده (Head-Up Display)
8. سیستم هشدار تصادف
9. سیستم تشخیص خستگی راننده
10. کنترل پایداری الکترونیکی
11. سیستم دیفرانسیل قفل خودکار 4MATIC+
12. آماری COMAND با نمایشگر لمسی 12.3 اینچی
13. ناوبری
14. اتصال بلوتوث
15. سیستم رانندگی Off-Road
16. سیستم Adaptive Damping System
17. سیستم Hill Start Assist
18. سیستم Hill Descent Control
19. تنظیم صندلی‌ها و گرمکن صندلی‌های جلو و عقب
20. سیستم هوشمند آسیستانس رانندگی

این فهرست تنها شامل برخی از آپشن‌های معمول ماشین جی کلاس است و ممکن است بسته به نسخه و سال ساخت خودرو، آپشن‌های دیگری نیز در دسترس باشند. برای اطلاعات دقیق‌تر، به دلیل تغییرات ممکن در آپشن‌ها و جزئیات فنی، به وبسایت رسمی مرسدس-بنز یا نمایندگی‌های محلی آن مراجعه کنید.
""",
    articleCar: """
جی کلاس ماشین‌های مرسدس بنز یک خط محصولی بسیار معروف و لوکس از خودروهای این شرکت است. این خط محصول شامل خودروهای سدان و SUV با طراحی قدرتمند و بارز است که برای رفاه و لذت سواری در طول مسافت‌های طولانی طراحی شده‌اند.

مدل‌های مختلف جی کلاس ماشین‌های مرسدس بنز شامل جی کلاس سدان (G-Class Sedan) و جی کلاس SUV (G-Class SUV) می‌شوند. هر دوی این مدل‌ها قدرتمند و بسیار محبوب هستند.

جی کلاس سدان مرسدس بنز دارای طراحی بارز و شیک با لوازم جانبی لوکس است. این خودرو به دلیل کیفیت ساخت بالا، امکانات پیشرفته و عملکرد قوی، جزو خودروهایی است که از آن لذت می‌برند.

جی کلاس SUV مرسدس بنز نیز یکی از خودروهای مشهور و با شهرت این شرکت است. آن دارای طراحی قدرتمند، قابل اعتماد و بسیار مقاوم است. جی کلاس SUV با قدرت موتورهای قدرتمند، قابلیت‌های خاص و طراحی بی‌نظیر، یک خودروی لوکس و ویژه است.

هر دوی این مدل‌ها با امکانات مدرنی همچون فناوری های رانندگی هوشمند، سیستم های ایمنی پیشرفته و امکانات رفاهی فراوان همراه هستند. قیمت این خودروها نیز به دلیل کیفیت و لوکس بودن آن‌ها، بالا است.

در کل، جی کلاس ماشین‌های مرسدس بنز به عنوان خودروهایی لوکس، قدرتمند و با کیفیت شناخته می‌شوند و برای علاقه‌مندان به خودروهای مجلل و لوکس گزینه‌ی بسیار مناسبی هستند.
اصالت و طراحی آیکونیک: جی کلاس، که به نام G-Wagon هم شناخته می‌شود، دارای تاریخچه‌ای غنی و طراحی آیکونیک است که از زمان معرفی آن در سال ۱۹۷۹ تقریباً تغییر نکرده است. طراحی کلاسیک و مقاوم آن در کنار ویژگی‌های داخلی لوکس، باعث شناخت فوری آن می‌شود.

قابلیت‌های خارج از جاده: جی کلاس به خاطر قابلیت‌های بی‌نظیر خود در مسیرهای خارج از جاده شناخته می‌شود. ساختار بدنه محکم، سیستم سه قفل دیفرانسیل و سیستم آواری پیشرفته، این خودرو را قادر می‌سازد با آسانی با مسیرهای دشوار مقابله کند. آیا این مسیرها صخره‌ای هستند یا مناظر زباله‌دوست؟ جی کلاس برای ارائه عملکرد خارج از جاده برجسته طراحی شده است.

گزینه‌های موتوری قدرتمند: مرسدس بنز مجموعه‌ای از گزینه‌های موتوری قدرتمند را برای جی کلاس ارائه می‌دهد تا عملکرد بالا و تجربه رانندگی هیجان‌انگیزی را فراهم کند. معمولاً موتورهایی با تنظیمات V8 یا V12 استفاده می‌شود که توان و گشتاور قابل توجهی را برای رانندگی در جاده و خارج از جاده ارائه می‌دهند.

داخلی لوکس: وقتی وارد داخل جی کلاس می‌شوید، یک کابین لاکچری و راحت را خواهید یافت. مرسدس بنز با توجه دقیق به جزئیات، از مواد با کیفیت بالا مانند چرم باریک، تریم چوب و زیورآلات فلزی استفاده می‌کند. صندلی‌ها فراوان و پشتیبانی کننده هستند و فناوری‌های پیشرفته برای راحتی و سرگرمی یکپارچه شده‌اند.

فناوری پیشرفته: با وجود ظاهر سختگیرانه خود، جی کلاس فناوری‌های پیشرفته را برای بهبود تجربه رانندگی به کار می‌گیرد. این خودرو دبهبود تجربه رانندگی در جی کلاس مرسدس بنز ایجاد می‌کند. این خودرو دارای سیستم سرگرمی با صفحه نمایش لمسی با کیفیت بالا، اتصال به گوشی هوشمند، سیستم‌های صوتی پیشرفته و سیستم‌های کمک رانندگی پیشرفته برای ایمنی و راحتی است.

نسخه‌های اختصاصی: مرسدس بنز گاهی اوقات نسخه‌های اختصاصی از جی کلاس را عرضه می‌کند که به ماشین اضافه لوکس و منحصر به فردی می‌پردازد. این نسخه‌های محدود معمولاً شامل رنگ‌های ویژه، عناصر طراحی ممتاز و گزینه‌های داخلی بی‌نظیر هستند که توسط مجموعه‌هایی از جمع‌آورندگان و علاقه‌مندان به خودرو جمع‌آوری می‌شوند.

محبوبیت جهانی: جی کلاس در سراسر جهان محبوبیت بالایی دارد و به عنوان یکی از نمادهای مرسدس بنز شناخته می‌شود. این خودرو به عنوان نمادی از قدرت، لوکس و استحکام در بازار خودرو جهانی شناخته می‌شود و در بسیاری از کشورها برای خریدارانی که به دنبال یک خودروی لوکس و خاص هستند، بسیار محبوب است.

با تمام این ویژگی‌ها، جی کلاس ماشین مرسدس بنز یک خودروی استثنایی و لوکس است که از تعهد مرسدس بنز به کیفیت و همچنین از تمامی قابلیت‌های یک خودروی چندمنظوره برخوردار است. با طراحی منحصر به فرد، عملکرد بی‌نظیر و امکانات لوکس، جی کلاس می‌تواند توجه هر علاقه‌مند به خودروهای خاص و مجلل را جلب کند.
""",
    id: "2",
  ),
  CarsModel(
    nameCarFA: "جی تی 43",
    nameCarEN: "AMG-GT",
    classCar: "کوپه",
    imgCar: "assets/img/AMG-GT/2022-AMG-GT43-4DR-COUPE-AVP-DR.webp",
    imgCarPNG: "assets/img/AMG-GT/2022-AMG-GT43-4DR-COUPE-AVP-DR.png",
    btnRedmore: "مشاهده",
    speed: "320",
    power: "362 اسب بخار",
    cityFuelEconomy: "19 mpg",
    highwayFuelEconomy: "25 mpg",
    acceleration: "3.2 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my22/gt-4dr-coupe/class-page/2022-AMG-GT-4DR-COUPE-CT-3-2-DR.mp4",
    passengerCapacity: "",
    engin: "3982",
    options: """
1. سیستم صوتی Burmester با توان خروجی بالا.
2. سیستم ناوبری به روز شده با صفحه نمایشگر بزرگ.
3. سیستم کنترل پایداری الکترونیکی (ESP) و سیستم کنترل جریان ترمز (EBL).
4. سیستم تعلیق قابل تنظیم AMG RIDE CONTROL.
5. دسته‌های تغییر دنده پشت فرمان (Paddle Shifters).
6. سیستم ترمز AMG High-Performance Brake System.
7. صندلی‌های اسپرت با پشتیبانی بالا و پوشش چرمی.
8. فرمان چرمی ورزشی با دکمه‌های کنترل.
9. سیستم اتصال بلوتوث و اتصال USB برای اتصال به دستگاه‌های خارجی.
10. سیستم پیش‌بینی خطر (PCC) برای تشخیص و هشداردهی در مواقع خطر.
""",
    articleCar: """
ماشین Mercedes-Benz AMG GT 43 یک خودروی ورزشی با عملکرد بالا و طراحی زیبا است. در زیر، برخی از اطلاعات و ویژگی‌های مهم در مورد این خودرو را برای شما ذکر می‌کنم:
1. موتور: مرسدس بنز AMG GT 43 دارای موتور شش سیلندری با ظرفیت 3.0 لیتر و توربوشارژر است. این موتور قدرت 367 اسب بخار و 520 نیوتن متر گشتاور را تولید می‌کند.
2. عملکرد: با استفاده از این موتور قوی، خودرو در حدود 4.9 ثانیه به سرعت 100 کیلومتر در ساعت می‌رسد و سرعت بالایی نزدیک به 270 کیلومتر در ساعت دارد.
3. جعبه دنده: ماشین AMG GT 43 به همراه جعبه دنده اتوماتیک 9 سرعته SPEEDSHIFT TCT AMG عرضه می‌شود. این جعبه دنده سرعت تغییرات سریع و صاف را فراهم می‌کند.
4. طراحی خارجی: خودرو AMG GT 43 دارای طراحی داینامیک و جذاب است که شامل خطوط منحنی و استایل ورزشی می‌شود. نمای جلویی با گریل عمودی و فرم باریک فوق‌العاده زیبا است.
5. داخلی: داخل خودرو AMG GT 43 با استفاده از مواد با کیفیت بالا و طراحی مدرن، شیک و لوکس است. صندلی‌های اسپرت، فرمان چرمی چندکاره و صفحه نمایشگر راننده 12.3 اینچی از جمله امکانات داخلی این خودرو است.
6. فناوری و امکانات: ماشین AMG GT 43 با امکانات پیشرفته‌ای مانند سیستم ناوبری، سیستم صوتی Burmester، سیستم اطلاعات و سرگرمی MBUX، سیستم هشدار تصادف، سیستم کنترل پایداری الکترونیکی و سیستم پارکینگ خودکار مجهز شده است.
7. سیستم صوتی Burmester: این خودرو با سیستم صوتی Burmester با توان خروجی 590 وات و هفت باند به همراه 12 بلندگو عملکرد بالا ارائه می‌شود.
8. سیستم تعلیق: خودرو AMG GT 43 دارای سیستم تعلیق قابل تنظیم است که به راننده امکان کنترل بهتر و خوش‌رفتاری بیشتر در طول رانندگی می‌دهد.
توجه داشته باشید که این فهرست تعدادی از ویژگی‌های مهم ماشین Mercedesبنز AMG GT 43 را شامل می‌شود. برای اطلاعات دقیق‌تر در مورد ماشین AMG GT 43 و آپشن‌های موجود، توصیه می‌کنم به وبسایت رسمی مرسدس-بنز یا نمایندگی‌های محلی آن مراجعه کنید.
9. سیستم های کنترل: ماشین AMG GT 43 مجهز به سیستم های کنترل پیشرفته است که شامل سیستم کنترل پایداری الکترونیکی (ESP)، سیستم کنترل جریان ترمز (EBL) و سیستم کنترل پیش‌بینی خطر (PCC) می‌شود. این سیستم ها بهبود کنترل و ایمنی خودرو را در شرایط مختلف رانندگی فراهم می‌کنند.
10. سیستم تعلیق: AMG GT 43 از سیستم تعلیق قابل تنظیم AMG RIDE CONTROL استفاده می‌کند. این سیستم امکان تنظیم سختی و نرمی تعلیق را بر اساس شرایط رانندگی فراهم می‌کند و تجربه رانندگیی بهتر و خوشایندتر را فراهم می‌کند.
11. سیستم ترمز: این خودرو از سیستم ترمز عالی و با عملکرد قوی AMG High-Performance Brake System استفاده می‌کند. این سیستم ترمز با دیسک‌های بزرگ و تجهیزات پیشرفته، توانایی ترمزگیری قوی و پایدار را در سرعت‌های بالا فراهم می‌کند.
12. طراحی داخلی: داخلی AMG GT 43 با استفاده از مواد با کیفیت بالا و جزئیات دقیق طراحی شده است. از جمله ویژگی‌های طراحی داخلی آن، می‌توان به صندلی‌های اسپرت با پشتیبانی بالا و پوشش چرمی، فرمان چرمی ورزشی با دکمه‌های کنترل، صفحه نمایشگر راننده 12.3 اینچی و سیستم صوتی Burmester اشاره کرد.
13. سیستم صوتی Burmester: این خودرو با سیستم صوتی Burmester با قدرت خروجی 590 وات و هفت باند ارائه می‌شود. این سیستم صوتی با کیفیت بالا و بازتولید دقیق صدا، تجربه صوتی حسابی را در داخل خودرو به شما ارائه می‌دهد.
14. امکانات راحتی و اتصال: AMG GT 43 دارای امکانات راحتی مانند سیستم ناوبری، سیستم اتصال بلوتوث و اتصال USB است. این امکانات به شما امکان مدیریت سیستم صوتی، دسترسی به اطلاعات رانندگی و اتصال به دستگاه‌های خارجی را می‌دهد.
از آنجا که مرسزد-بنز AMG GT 43 یک خودروی ورزشی عالی است، این توضیحات تنها برخی از ویژگی‌ها و امکانات آن را شامل می‌شود. اگر شما به جزئیات بیشتری در مورد این خودرو علاقه‌مند هستید، پیشنهاد می‌کنم به وبسایت رسمی مرسدس-بنز مراجعه کنید یا با نمایندگی‌های محلی مرسدس-بنز تماس بگیرید تا اطلاعات دقیق‌تری دریافت کنید.
""",
    id: "3",
  ),
  CarsModel(
    nameCarFA: "میباخ",
    nameCarEN: "MAYBACH",
    classCar: "واگن",
    imgCar: "assets/img/maybach/2022-MAYBACH-SEDAN-AVP-DR.webp",
    imgCarPNG: "assets/img/maybach/2022-MAYBACH-SEDAN-AVP-DR.png",
    btnRedmore: "مشاهده",
    speed: "320",
    power: "621 hp",
    cityFuelEconomy: "12 mpg",
    highwayFuelEconomy: "20 mpg",
    acceleration: "4.5 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my23/s/maybach/class-page/series/S_maybach-page-hero-video.mp4",
    passengerCapacity: "5 نفره",
    engin: "3982",
    options: """
1. صندلی‌های ماساژور و مجهز به سیستم‌های گرمایش و خنک کننده
2. سیستم صوتی های-اند-اویس (High-End Audio System)
3. نمایشگرهای بزرگ و قابل لمس برای سیستم اطلاعات و ناوبری
4. سقف پانوراما با قابلیت باز و بسته شدن
5. سیستم کنترل خودکار فاصله (Adaptive Cruise Control)
6. سیستم شناسایی ترافیک و هشدار تصادف
7. سیستم کنترل کیفیت هوا (Air Quality Control System)
8. سیستم پارکینگ خودکار
9. سیستم کنترل پایداری (Stability Control System)
10. سیستم هشدار خستگی راننده
11. سیستم اطلاعات راننده (Head-up Display)
12. سیستم گرمایش و سرمایش هوای خودرو (Climate Control System)
13. سیستم تشخیص نقاط کور (Blind Spot Detection System)
14. سیستم ایمنی هوشمند (Intelligent Safety System)
15. سیستم تشخیص علائم راهنمایی و رانندگی (Traffic Sign Recognition System)
16. سیستم ردیابی خودرو (Vehicle Tracking System)
17. سیستم هشدار تصادف جلو (Forward Collision Warning System)
18. سیستم هشدار خروج از مسیر (Lane Departure Warning System)
19. سیستم تشخیص عابرین (Pedestrian Detection System)
20. سیستم تشخیص خستگی راننده

این تنها یک فهرست مختصر از آپشن‌های موجود در خودروهای مرسدس-بنز میباخ است، و بسته به مدل و نسل خودرو، آپشن‌های دیگری نیز ممکن است موجود باشند.
""",
    articleCar: """
مرسدس-بنز میباخ (Mercedes-Benz Maybach) یک برند فاخر و لوکس است که تحت لیسانس و در محصولات مرسدس-بنز تولید می‌شود. خودروهای میباخ برای مشتریانی که به دنبال بالاترین سطح لوکس و کیفیت هستند، طراحی و ساخته می‌شوند. در ادامه، برخی از اطلاعات مربوط به خودروهای میباخ را برای شما توضیح می‌دهم:

1. طراحی: خودروهای مرسدس-بنز میباخ دارای طراحی بسیار زیبا و شیک هستند. آن‌ها از جزئیات دقیق، نمای خارجی آرامش‌بخش و خطوط انحنایی استفاده می‌کنند که به آن‌ها ظاهری بسیار خاص و استثنایی می‌بخشد.

2. داخلی: داخلی خودروهای مرسدس-بنز میباخ بسیار لوکس و رفاه‌بخش است. از جنس‌ها و مواد با کیفیت بالا، چرم نرم و چوب گران قیمت استفاده می‌شود. فضای داخلی بزرگ و فراهم کننده امکانات لوکس مانند صندلی‌های ماساژور، سیستم صوتی فوق‌العاده، سیستم های اتصال پیشرفته و نمایشگرهای بزرگ، به کاربران احساس راحتی و لذت می‌دهد.

3. کمربند ایمنی: خودروهای میباخ با سیستم‌های ایمنی پیشرفته مجهز شده‌اند. این شامل کمربند ایمنی، سیستم کنترل پایداری الکترونیکی (ESP)، سیستم کنترل فاصله و سرعت خودرو (DISTRONIC) و سیستم هشدار تصادف می‌شود.

4. تجهیزات رفاهی: خودروهای مرسدس-بنز میباخ با تمرکز بر راحتی و لذت سفر طراحی شده‌اند. آن‌ها امکاناتی مانند سیستم کنترل دما، سیستم تهویه مستقل برای هر صندلی، سیستم هشدار بی‌سابقه، و سیستم تصفیه هوای خاص را در اختیار مشتریان قرار می‌دهند.

5. موتورها: خودروهای مرسدس-بنز میباخ از موتورهای قدرتمند و پیشرانه‌های فوق العاده استفاده می‌کنند. این موتورها عملکرد برتر، تسریع قوی و تجربه رانندگیی هیجان‌انگیز را فراهم می‌کنند.

لطفاً توجه داشته باشید که اطلاعاتی که من ارائه دادم ممکن است با توسعه و به‌روزرسانی محصولات مرسدس-بنز میباخ تغییر کند. برای دریافت اطلاعات دقیق‌تر و به‌روزتر، بهتر است به وبسایت رسمی مرسدس-بنز مراجعه کنید یا با نمایندگی‌های محلی مرسدس-بنز تماس بگیرید.


مرسدس-بنز میباخ (Mercedes-Benz Maybach) علاوه بر طراحی بسیار لوکس و استثنایی خود، به دلیل ویژگی‌ها و تجهیزات خاصی که در آنها استفاده می‌شود، به عنوان نمادی از بالاترین سطح از لوکس و رفاه شناخته می‌شود. در زیر، برخی از ویژگی‌ها و تجهیزات برجسته مرسدس-بنز میباخ را برایتان توضیح می‌دهم:

1. صندلی‌ها: صندلی‌های میباخ با استفاده از مواد با کیفیت بالا و طراحی دقیق، برای راحتی و لذت سفر بهینه شده‌اند. آنها اغلب دارای قابلیت تنظیم برقی و پشتیبانی بالا برای فضای پا و پشتی است. همچنین، برخی از مدل‌های میباخ دارای صندلی‌های ماساژور نیز می‌باشند که امکانات مختلفی مانند ماساژ، تهویه و گرمایش را فراهم می‌کنند.

2. سیستم تهویه و تصفیه هوا: خودروهای میباخ دارای سیستم تهویه و تصفیه هوای پیشرفته‌ای هستند که به راحتی می‌توانید دما و جریان هوای درون خودرو را تنظیم کنید. این سیستم علاوه بر تهویه هوا، قادر است هوای داخل خودرو را تصفیه کرده و از آلاینده‌ها و ذرات معلق در هوا جلوگیری کند.

3. سیستم صوتی برمستر: خودروهای میباخ مجهز به سیستم صوتی برمستر (Burmester) هستند که با توان خروجی بالا و امکانات پیشرفته، تجربه‌ای صوتی استثنایی را فراهم می‌کند. این سیستم شامل بلندگوهای قدرتمند، ساب‌ووفرها و تکنولوژی‌های پردازش صوتی است که کیفیت صدای بی‌نظیری را به شما ارائه می‌دهد.

4. سیستم اطلاعات و ناوبری: خودروهای میباخ دارای سیستم اطلاعات و ناوبری پیشرفته‌ای هستند که شامل صفحه نمایشگرهای بزرگ و قابل لمس، سیستم ناوبری به‌روز شده و اتصال به اینترنت می‌شود. این سیستم به شما امکان می‌دهد به طور آسان به مقصد خود راهنمایی شوید و از امکانات ارتباطی و سرگرمی مدرن استفاده کنید.

5. فض6. فضای بزرگ: خودروهای مرسدس-بنز میباخ دارای فضای داخلی بسیار بزرگ و فراهم است. این فضا به مسافران امکان سفر با راحتی بیشتر و حرکت آزادتر را می‌دهد. صندلی‌های عقب نیز به طور معمول با فضای پا بزرگ و امکانات راحتی برای مسافران عقب طراحی شده‌اند.

7. سیستم هشدار امنیتی: خودروهای مرسدس-بنز میباخ دارای سیستم هشدارهای امنیتی پیشرفته‌ای هستند. این سیستم‌ها شامل سیستم‌های تشخیص تصادف، سیستم‌های کمک به راننده، سیستم‌های کنترل پایداری و سایر فناوری‌های ایمنی هستند که احتمال وقوع حوادث را کاهش می‌دهند و سطح ایمنی خودرو را ارتقاء می‌بخشند.

8. طراحی خارجی: خودروهای مرسدس-بنز میباخ دارای طراحی بسیار زیبا و شگفت‌انگیزی هستند. خطوط آرامش‌بخش، نمای براق و جزئیات دقیق در طراحی خودروها به آنها ظاهری منحصر به فرد و جذاب می‌بخشد. همچنین، از مواد با کیفیت بالا و پیشرفته در ساخت بدنه خودرو استفاده می‌شود که مقاومت و ایمنی را تضمین می‌کند.

9. موتورها و قدرت: خودروهای میباخ اغلب از موتورهای قدرتمند و پیشرانه‌های با عملکرد بالا استفاده می‌کنند. این موتورها از تکنولوژی‌های مدرن و نوآوری‌های پیشرفته برخوردار هستند و تسریع قوی و تجربه رانندگی هیجان‌انگیز را فراهم می‌کنند.

10. خدمات ویژه: مشتریان خریداری کننده خودروهای مرسدس-بنز میباخ از خدمات ویژه و مزایای لوکسی بهره‌مند می‌شوند. این شامل سرویس و تعمیرات ویژه، خدمات خریداری و تحویل خودرو در محل مشتری و خدمات مربوط به پشتیبانی مشتری می‌شود.

این فقط برخی از ویژگی‌ها و تجهیزاتی هستند که در خودروهای میباخ مرسدس-بنز مشترک است. هر مدل و نسل خودرو میباخ می‌تواند ویژگی‌ها و تج
""",
    id: "4",
  ),
  CarsModel(
    nameCarFA: "سی ال اس",
    nameCarEN: "CLS",
    classCar: "کوپه",
    imgCar: "assets/img/CLS/2022-CLS-COUPE-AVP-DR.webp",
    imgCarPNG: "assets/img/CLS/2022-CLS-COUPE-AVP-DR.png",
    btnRedmore: "مشاهده",
    speed: "320",
    power: "362 hp",
    cityFuelEconomy: "22 mpg",
    highwayFuelEconomy: "30 mpg",
    acceleration: "4.5 ثانیه",
    carVideo:
        "https://www.mercedes-amg.com/en/vehicles/cls/coupe/_jcr_content/stage/media/slides/slide_copy_copy/media1/video.video.20210406160320.mp4",
    passengerCapacity: "نفره 5",
    engin: "لیتری 6 توربو خطی با محرک ",
    options: """
1. سیستم هدآپ (Head-up Display): این سیستم به راننده امکان می‌دهد اطلاعات مهم را در قسمت پنجره جلویی نمایش دهد، به طوری که راننده برای مشاهده اطلاعات مانند سرعت خودرو، دستورات ناوبری و اطلاعات سیستم هشدارها نیازی به برگرداندن نگاه خود به پنل ابزار نداشته باشد.

2. سیستم صوتی Burmester: Burmester یکی از برندهای معتبر در زمینه صوتی است که سیستم صوتی اختصاصی خود را برای سیستم‌های صوتی خودروهای مرسدس-بنز ارائه می‌دهد. این سیستم صوتی با کیفیت بالا و صدای قوی و واضح را برای تجربه صوتی بهبود می‌بخشد.

3. سیستم هوشمندی مرکزی: این سیستم شامل صفحه‌نمایش بزرگ و قابل لمس در قسمت مرکزی صفحه کنترل می‌شود که امکانات ناوبری، سیستم صوتی، تنظیمات خودرو و اتصال به دستگاه‌های جانبی را در اختیار راننده قرار می‌دهد.

4. فرمان چرمی: آپشن فرمان چرمی با جزئیات دقیق و طراحی با کیفیت بالا به راننده امکان می‌دهد تا تجربه رانندگی لوکس تری داشته باشد.

5. سیستم کنترل خودکار فاصله: این سیستم با استفاده از سنسورها و رادارها به راننده کمک می‌کند فاصله ایمن خودرو را با خودروهای جلویی حفظ کند، همچنین می‌تواند سرعت خودرو را به طور خودکار تنظیم کند و در صورت نیاز تا سرعت صفر توقف کند.

6. سیستم کمک به رانندگی: این شامل امکاناتی مانند آب و هواسنجی، سیستم‌های هشدار تصادف، ردیابی لبه جاده، تشخیص خستگی راننده و سیستم‌های کمکی دیگر است که به راننده در ایجاد رانندگی ایمن و مطمئنادامه می‌دهد:

7. سیستم آیینه‌های جانبی برقی: آپشن آیینه‌های جانبی برقی به راننده امکان می‌دهد آیینه‌های جانبی را به طور الکتریکی تنظیم کند، که تسهیل کننده‌ای برای تنظیم بهینه دید در عقب و در کناره خودرو است.

8. سیستم پارکینگ خودکار: این سیستم با استفاده از سنسورها و دوربین‌ها، به راننده در عملیات پارک کردن کمک می‌کند. آن به طور خودکار فضای مناسب را برای پارک کردن یافته و دستورات را برای راننده نمایش می‌دهد.

9. سقف پانوراما: آپشن سقف پانوراما به راننده و مسافران امکان می‌دهد مناظر طبیعی را از طریق سقف خودرو ببینند. این سقف شیشه‌ای بزرگ و وسیع ایجاد می‌کند که تجربه رانندگی را لذت بخش‌تر می‌کند.

10. سیستم نورپردازی داخلی: این سیستم از روشنایی LED برای ایجاد جو روشنایی و جذاب در داخل خودرو استفاده می‌کند. این آپشن به راننده امکان می‌دهد رنگ و شدت نور را تغییر دهد و فضای داخلی را به طور شخصی‌سازی شده تر و زیباتر کند.

این فقط چند نمونه از آپشن‌های محبوب ماشین سی ال اس مرسدس-بنز هستند. همچنین، به طور معمول، مرسدس-بنز به صورت مداوم آپشن‌ها و تجهیزات جدید را معرفی می‌کند، بنابراین لیست بالا فقط یک نمای کلی از آپشن‌های موجود است و ممکن است با توجه به سال تولید و ناحیه جغرافیایی متغیر باشد.
""",
    articleCar: """
سی ال اس معروف به طراحی زیبا و خطوط باریک خود است که به آن ظاهر کوپه‌ای می‌دهد. این مدل با ترکیب قابلیت‌های یک سدان و امکانات یک خودروی ورزشی، جذابیت خاصی دارد. در زیر، برخی از ویژگی‌ها و اطلاعات مربوط به سیستم CLS را می‌توانید بیابید:

طراحی بیرونی: سی ال اس با طراحی خودروهای کوپه‌ای ورزشی، خطوط باریک و پیشرانه‌ای دارد که به آن ظاهر شیک و دینامیک می‌بخشد. طراحی جدیدترین مدل‌ها شامل گریل بزرگ، فول LED هدلایت‌ها و خطوط شیبدار بوده است.

داخلی لوکس: داخلی سی ال اس با استفاده از مواد با کیفیت بالا و پوشش‌های چرمی مرغوب تزئین شده است. طراحی داخلی آن به صورت مدرن و الگوبرداری شده از خطوط کوپه‌های ورزشی است.

فضای داخلی: سی ال اس دارای محیطی فضایی است که به آسایش و راحتی سرنشینان اهمیت می‌دهد. با توجه به طراحی کوپه‌ای، فضای سر و پا برای سرنشینان عقب کمی محدودتر است.

تکنولوژی پیشرفته: سیستم CLS با استفاده از جدیدترین فناوری‌های مرسدس-بنز، شامل صفحه نمایش دیجیتال برای سیستم اطلاعات و سرگرمی، سیستم صوتی برند Burmester، سیستم هدآپ (Head-up Display) و سیستم‌های کمکی رانندگی پیشرفته مانند سیستم هشدار تصادف و سیستم کنترل خودکار فاصله، بهبود و راحتی رانندگی را بهبود می‌بخشد.

موتورهای قدرتمند: مدل‌های CLS با موتورهای قدرتمندی از جمله موتورهای بنزینی و دیزلی با قدرت و کارایی بالا ارائه می‌شوند. موتورهای AMG با قدرت بیشتر و عملکرد ورزشی نیز برای علاقه‌مندان بهماشین‌های سی ال اس از سال 2021 شامل مدل‌های زیر می‌شوند:

مرسدس-بنز CLS 450: این مدل با یک موتور بنزینی شش سیلندر توربوشارژر 3.0 لیتری و قدرت 362 اسب بخار و یک سیستم هیبرید 48 ولتی EQ Boost عرضه می‌شود. دارای پیشرانه پنجه‌ای 9 سرعته و سیستم پیشرانش چهار چرخ است.

مرسدس-بنز AMG CLS 53: این مدل توسط بخش AMG مرسدس-بنز تولید می‌شود و دارای موتور شش سیلندر توربوشارژر 3.0 لیتری با قدرت 429 اسب بخار و یک سیستم هیبرید 48 ولتی EQ Boost است. دارای پیشرانه پنجه‌ای 9 سرعته و سیستم پیشرانش چهار چرخ است.

مرسدس-بنز AMG CLS 63 S: این مدل برترین نسخه از سی ال اس است و توسط بخش AMG مرسدس-بنز ساخته می‌شود. دارای موتور V8 4.0 لیتری توربوشارژر با قدرت 603 اسب بخار است. دارای پیشرانه پنجه‌ای AMG SPEEDSHIFT MCT 9 سرعته و سیستم پیشرانش چهار چرخ است.

این ماشین‌ها با طراحی شیک و ورزشی، فضای داخلی لوکس و تکنولوژی پیشرفته، همچنین انتخاب گزینه‌های سفارشی برای اضافه کردن آپشن‌های بیشتر به تجهیزات، انتخابی مناسب برای علاقه‌مندان به خودروهای سدان لوکس و ورزشی می‌باشند.
""",
    id: "5",
  ),
  CarsModel(
    nameCarFA: "جی ال اس",
    nameCarEN: "GLS",
    classCar: "شاسی بلند",
    imgCar: "",
    imgCarPNG: "assets/img/GLS/2022-GLS450-SUV-AVP-DR.png",
    btnRedmore: 'more',
    speed: "320",
    power: "362 hp",
    cityFuelEconomy: "18 mpg",
    highwayFuelEconomy: "23 mpg",
    acceleration: "5.9 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my23/gls/suv/class-page/series/2023-GLS-SUV-CT-3-6-DR.mp4",
    passengerCapacity: "7 نفره",
    engin: " 3 سیلندر توربو",
    options: """
1. سیستم هوشمند MBUX
2. سیستم صوتی Burmester 3D
3. سیستم هدآپ (Head-up Display)
4. سیستم کنترل خودکار فاصله
5. سیستم ناوبری GPS
6. سقف پاناروما
7. صندلی‌های ماساژ
8. سیستم تهویه خودکار چند منطقه
9. سیستم تهویه عرضی
10. سیستم گرمایش و سرمایش صندلی‌ها
11. دوربین‌های ۳۶۰ درجه و سیستم پارکینگ خودکار
12. سیستم‌های ایمنی پیشرفته مرسدس-بنز مانند سیستم‌های کنترل پایداری، سیستم‌های کمک راننده و سیستم‌های تشخیص تصادف.

لطفاً توجه داشته باشید که لیست آپشن‌ها ممکن است بر اساس نسخه، سال تولید و منطقه فروش متغیر باشد.
""",
    articleCar: """
مدل جی ال اس (GLS) مرسدس-بنز یک خودروی SUV لوکس و بزرگ است که به عنوان یکی از مدل‌های برجسته و پرطرفدار مرسدس-بنز شناخته می‌شود. این خودرو با طراحی شیک، امکانات فراوان و عملکرد قوی، برای تجربه رانندگی لوکس و خوشایند طراحی شده است. در زیر، به برخی از ویژگی‌ها و آپشن‌های قابل توجه جی ال اس مرسدس-بنز اشاره می‌کنم:

1. ظاهر بزرگ و خودرنگ: جی ال اس دارای طراحی بزرگ و ایمن با خطوط شیک و پویا است. با نمای جلویی خاص و شبکه بزرگ مشابه با سایر خودروهای مرسدس-بنز، جی ال اس شخصیت خود را به خوبی نشان می‌دهد.

2. داخلی فاخر: فضای داخلی جی ال اس با استفاده از مواد با کیفیت بالا، پوستهای گرم و چوب گران قیمت، طراحی شده است. صندلی‌های راحت و فضای بزرگ برای سرنشینان امکان تجربه راحتی بی‌نظیر را می‌دهد.

3. سیستم هوشمند MBUX: جی ال اس مجهز به سیستم MBUX مرسدس-بنز است که شامل صفحه‌نمایش بزرگ و قابل لمس، کنترل صوتی با هوش مصنوعی و امکان اتصال به اسمارتفون‌ها و دستگاه‌های جانبی است. این سیستم به راننده امکان می‌دهد تمامی امکانات راحتی و سرگرمی را در دسترس داشته باشد.

4. سیستم صوتی Burmester 3D: جی ال اس می‌تواند با سیستم صوتی Burmester 3D مجهز شود که صدای قوی و واضح را ارائه می‌دهد. این سیستم با استفاده از بهینه‌سازی صدا و فناوری‌های پیشرفته، تجربه صوتی بی‌نظیری را فراهم می‌کند.

5. سیستم هدآپ (Head-up Display): این سیستم به راننده امکان می‌دهد اطلاعات مهم مانند سرعت خودرو، دستورات ناوبری و اطلاعات سیستم هشدارها را در قسمت پنجره جلویی نمایش دهد، بدون نیاز به برگرداندن نگاه به پنل ابزار.

6. سیستم کنترل خودکار فاصله: جی ال اس مجهز به سیستم کنترل خودکار فاصله است که به راننده در حفظ فاصله ایمن با خسیارات جلویی کمک می‌کند. این سیستم می‌تواند خودرو را به طور خودکار تنظیم کند و در صورت نیاز تا سرعت کامل توقف کند.

7. انواع موتورها: جی ال اس در برخی از نسخه‌ها با موتورهای قدرتمند عرضه می‌شود. این شامل موتورهای بنزینی و دیزلی با گزینه‌های V6 و V8 است. همچنین، نسخه هیبریدی نیز در دسترس است که از ترکیب موتور بنزینی و موتور الکتریکی استفاده می‌کند.

8. سیستم‌های ایمنی: جی ال اس مجهز به سیستم‌های ایمنی پیشرفته مرسدس-بنز است که شامل سیستم‌های کنترل پایداری، سیستم‌های کمک راننده، سیستم‌های تشخیص تصادف و سیستم‌های مانع‌های فعال است. این سیستم‌ها به افزایش ایمنی خودرو و کاهش خطرات جاده‌ای کمک می‌کنند.

9. سیستم سرگرمی و رفاهی: جی ال اس دارای امکانات رفاهی فراوانی است از جمله سیستم تهویه خودکار چند منطقه، صندلی‌های ماساژ، سیستم‌های گرمایش و سرمایش صندلی‌ها، سقف پاناروما و سیستم تهویه عرضی.

جی ال اس مرسدس-بنز یک خودروی لوکس و عملکرد بالا است که با طراحی شیک، داخلی فاخر و امکانات پیشرفته، تجربه رانندگی لوکس و راحتی بی‌نظیر را فراهم می‌کند. البته، توصیه می‌شود برای اطلاعات دقیق‌تر و جزئی‌تر در مورد مدل‌ها و آپشن‌های مختلف، به وب‌سایت رسمی مرسدس-بنز یا نمایندگی‌های محلی آن مراجعه کنید.
""",
    id: "6",
  ),
  CarsModel(
    nameCarFA: "سی کلاس",
    nameCarEN: "C-class",
    classCar: "کوپه",
    imgCar: "",
    imgCarPNG: "assets/img/C-class/2022-C300-CABRIOLET-AVP-DR.png",
    btnRedmore: "more",
    speed: "320",
    power: "255 hp",
    cityFuelEconomy: "21 mpg",
    highwayFuelEconomy: "30 mpg",
    acceleration: "6.2 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my22/c/cab/class-page/series/2021-C-CABRIOLET-CT-3-2-DR.mp4",
    passengerCapacity: "4 نفره",
    engin: "2 سیلند",
    options: """
1. سیستم هوشمند MBUX
2. سیستم صوتی Burmester
3. سیستم هدآپ (Head-up Display)
4. سقف پانوراما
5. صندلی‌های گرمایشی و تهویه‌دار
6. سیستم پارکینگ خودکار
7. دوربین ۳۶۰ درجه
8. سیستم ناوبری GPS
9. سیستم کنترل خودکار فاصله
10. سیستم‌های ایمنی پیشرفته مرسدس-بنز، از جمله سیستم کنترل پایداری، سیستم‌های کمک راننده و سیستم‌های تشخیص تصادف.
""",
    articleCar: """
مرسدس-بنز سری C-Class (سی کلاس) یک خودروی لوکس و محبوب است که به عنوان یکی از مدل‌های برجسته و پرفروش مرسدس-بنز شناخته می‌شود. سی کلاس به عنوان خودروی کوچک‌تر و بزرگ‌تر از سری E-Class (ای کلاس) قرار دارد و به عنوان یک خودروی خانوادگی و کاربری روزمره طراحی شده است. در زیر، به برخی از ویژگی‌ها و آپشن‌های قابل توجه سی کلاس مرسدس-بنز اشاره می‌کنم:

طراحی زیبا و شیک: سی کلاس دارای طراحی شیک و خطوط داینامیک است که به آن شخصیت خود را نشان می‌دهد. با نمای جلویی با شبکه بزرگ مشابه با سایر خودروهای مرسدس-بنز و طراحی باریک و استوانه‌ای، سی کلاس جذابیت ظاهری منحصر به فردی دارد.

داخلی مجلل و فاخر: فضای داخلی سی کلاس با استفاده از مواد با کیفیت بالا، پوستهای گرم و چوب گران قیمت، طراحی شده است. صندلی‌های راحت و فضای بزرگ برای سرنشینان امکان تجربه راحتی بی‌نظیر را می‌دهد.

سیستم هوشمند MBUX: سی کلاس مجهز به سیستم MBUX مرسدس-بنز است که شامل صفحه‌نمایش بزرگ و قابل لمس، کنترل صوتی با هوش مصنوعی و امکان اتصال به اسمارتفون‌ها و دستگاه‌های جانبی است. این سیستم به راننده امکان می‌دهد تمامی امکانات راحتی و سرگرمی را در دسترس داشته باشد.

سیستم صوتی Burmester: سیستم صوتی Burmester با کیفیت بالا در سی کلاس عرضه می‌شود. این سیستم صدا بی‌نظیری را ارائه می‌دهد و با استفاده از بهینه‌سازی صدا و فناوری‌های پیشرفته، تجربه صوتی عالی را فراهم می‌کند.

سیستم هدآپ (Head-up Display): سیستم هدآپ در سی کلاس موجب نمایش اطلاعات مهم مانند سرعت خودرو، دستورات ناوبری و اطلاعات سیستم هشدارها در قسمت پنجره جلویی می‌شود، بدون نیاز به برگرداندن نگاه به پنل ابزار.

انواع موتورها: سی کلاس در برخی از نسختوجه داشته باشید که برخی از اطلاعات ممکن است بسته به سال تولید، نسخه و منطقه فروش متغیر باشد
""",
    id: "7",
  ),
  CarsModel(
    nameCarFA: "اس کلاس",
    nameCarEN: "S-class",
    classCar: "واگن",
    imgCar: "",
    imgCarPNG: "assets/img/S-class/2022-S500-SEDAN-AVP-DR.png",
    btnRedmore: "more",
    speed: "320",
    power: "362 hp",
    cityFuelEconomy: "20 mpg",
    highwayFuelEconomy: "29 mpg ",
    acceleration: "4.4 ثانیه",
    carVideo: "",
    passengerCapacity: "5 نفره",
    engin: "3 لیتری",
    options: """
سیستم هوشمند MBUX
سیستم صوتی Burmester
سیستم هدآپ (Head-up Display)
سقف پانوراما
صندلی‌های گرمایشی و تهویه‌دار
سیستم پارکینگ خودکار
دوربین ۳۶۰ درجه
سیستم ناوبری GPS
سیستم کنترل خودکار فاصله
سیستم‌های ایمنی پیشرفته مرسدس-بنز، از جمله سیستم کنترل پایداری، سیستم‌های کمک راننده و سیستم‌های تشخیص تصادف.

موتور: موتور 6 سیلندر توربوشارژ با حجم 3 لیتر با قدرت 430 اسب بخار

سیستم تعلیق: تعلیق هوا با کنترل الکترونیکی

سیستم ترمز: ترمزهای کاربن سرامیکی

سیستم فرمان: فرمان الکترو مکانیکی متغیر بر اساس سرعت

صندلی ها: صندلی های ورزشی AMG

سیستم صوتی: سیستم صوتی Burmester با 13 بلندگو

ایمنی: 9 کیسه هوا از جمله کیسه هوای زانو برای راننده

دستیار راننده: سیستم کمک فرمان، هشدار تغییر خطوط و دوربین 360 درجه

سقف: سقف پانوراما

چرخ ها: چرخهای آلومینیومی AMG با طرح 5 سوراخه

ظاهر: بدنه ویژه AMG با اگزوز بزرگتر

""",
    articleCar: """
ماشین مرسدس بنز SL یک خودروی ورزشی با کلاس و لوکس است که توسط شرکت مرسدس بنز ساخته و به بازار عرضه شده است. این خودرو برای تفریح و سرگرمی طراحی شده است و از طراحی زیبا و عملکرد عالی برخوردار است.

مرسدس بنز SL جزو خودروهایی است که از آخرین فناوری‌ها و امکانات جدید برای بهبود عملکرد و کارایی استفاده می‌کند. این خودرو دارای موتور قدرتمندی است که در بسیاری از مدل‌ها از موتور‌های V6 و V8 استفاده می‌شود و قدرت حداکثر آن می‌تواند به بیش از 500 اسب بخار برسد. همچنین، این خودرو دارای سیستم تعلیق قوی و پویا است که امکان کنترل بهتر خودرو در خطوط خمیده و رانندگی در شرایط سرعت بالا را فراهم می‌کند.

در طراحی داخلی، مرسدس بنز SL دارای صندلی‌های گرمکن، سیستم صوتی با کیفیت بالا، سیستم ناوبری هوشمند، دوربین و سیستم سوخت‌رسانی انعطاف‌پذیر است. از لحاظ امنیتی، این خودرو دارای راننده خودکار، مانیتورینگ ترافیک، سیستم هشدار تصادف و ترمز‌های ABS است.

مرسدس بنز SL با توجه به ویژگی‌های لوکس و عملکرد عالی خود، برای خریدارانی که به دنبال یک خودروی ورزشی با کلاس و قدرت هستند، یک گزینه عالی است.


مرسدس بنز SL از دیدگاه طراحی، به شکلی شیک و خیره کننده طراحی شده است که با استفاده از جزئیات بارز و خطوط تمیز، شخصیت قوی و منحصر به فردی دارد. بدنه این خودرو از آلیاژ آلومینیوم ساخته شده است که باعث کاهش وزن و افزایش عملکرد و کارایی خودرو شده است.

مرسدس بنز SL دارای سیستم های بسیاری است که برای افزایش رانندگی در شرایط مختلف طراحی شده است. این خودرو دارای سیستم Dynamic Select است که به راننده این امکان را می‌دهد تا حالت‌های مختلف را برای رفتار خودرو انتخاب کند. این خودرو همچنین دارای سیستم Airscarf است که باعث می‌شود در هوای سرد، گرما به گردن راننده و مسافر جانبی داده شود.

در داخل خودرو نیز، طراحی شیک و لوکسی به چشم می‌خورد. این خودرو دارای صندلی‌های گرمکن و خنک کننده است که به راحتی قابل تنظیم هستند و برای راننده و مسافران جانبی راحتی بیشتری را به ارمغان می‌آورند. همچنین، این خودرو دارای سیستم ناوبری هوشمند، سیستم صوتی با کیفیت بالا و دیگر امکانات جذاب دیگری است که برای راحتی و لذت بردن از رانندگی طراحی شده است.

در کل، مرسدس بنز SL یک خودروی ورزشی لوکس و با کلاس است که با استفاده از آخرین فناوری‌ها و امکانات جدید، کیفیت بالا و عملکرد عالی را به راننده و مسافران جانبی خود ارائه می‌دهد. این خودرو برای خریدارانی که به دنبال یک تجربه رانندگی لوکس، امن و هیجان‌انگیز هستند، یک گزینه عالی است.


مرسدس بنز SL با استفاده از تکنولوژی‌های پیشرفته، دارای عملکرد بسیار بالا است. این خودرو دارای سیستم تعلیق قوی است که به راننده این امکان را می‌دهد تا در حین رانندگی در شرایط مختلف، کنترل بهتری از خودرو داشته باشد. همچنین، این خودرو دارای سیستم ترمز‌های ABS، سیستم کنترل پایداری الکترونیکی (ESC) و سیستم کنترل ترمز (BAS) است که به راننده در شرایط خطرناک کمک می‌کند و ایمنی رانندگی را بهبود می‌بخشد.

مرسدس بنز SL دارای موتور‌های قدرتمندی است که برای افزایش عملکرد خودرو طراحی شده‌اند. برای مثال، مدل SL 500 دارای موتور V8 با حجم 4.7 لیتر و قدرت حداکثر 449 اسب بخار است. همچنین، مدل SL 63 AMG دارای موتور V8 با حجم 5.5 لیتر و قدرت حداکثر 577 اسب بخار است که قدرت بیشتری را به راننده می‌دهد.

در داخل خودرو نیز، مرسدس بنز SL دارای امکانات لوکس و جذابی است. این خودرو دارای صندلی‌های گرمکن و خنک کننده است که به راحتی قابل تنظیم هستند و برای راننده و مسافران جانبی راحتی بیشتری را به ارمغان می‌آورند. همچنین، این خودرو دارای سیستم صوتی با کیفیت بالا، سیستم ناوبری هوشمند، دوربین و سیستم سوخت‌رسانی انعطاف‌پذیر است که به راننده این امکان را می‌دهد تا تجربه‌ای راحت و لذت بخش از رانندگی داشته باشد.

در کل، مرسدس بنز SL یک خودروی ورزشی لوکس با کلاس و عملکرد بالاست که برای خریدارانی که به دنبال یک خودروی لوکس ورزشی هستند، یک گزینه عالی است. با توجه به طراحی زیبا، امکانات لوکس، عملکرد قوی و ایمنی بالا، این خودرو انتخاب خوبی برای افرادی است که به دنبال تجربه‌ای لذت بخش از رانندگی هستند.
""",
    id: "8",
  ),
  CarsModel(
    nameCarFA: "ای کیو ای",
    nameCarEN: "EQE-Sedan",
    classCar: "برقی",
    imgCar: "",
    imgCarPNG: "assets/img/EQE-Sedan/2023-EQE350-SEDAN-AVP-DR.png",
    btnRedmore: "more",
    speed: "320",
    power: "329 hp",
    cityFuelEconomy: "",
    highwayFuelEconomy: "",
    acceleration: "5.9 ثانیه",
    carVideo: "",
    passengerCapacity: "5 نفره",
    engin: "",
    options: """
 کنترل سرعت خودکار هوشمند (Adaptive Cruise Control)

• هشدار نزدیکی به وسیله جلو (Front Collision Warning)

• ترمز اضطراری خودکار (Automatic Emergency Braking)

• هشدار تغییر خط (Lane Departure Warning)

• کمک به سیستم نگه داشتن در خط حرکت (Lane Keeping Assist)

• هشدار تغییر خط خودکار (Lane Change Assist)

• هشدار ترافیک عبوری از جانبی (Cross Traffic Alert)

• سیستم پارکینگ خودکار (Autonomous Parking)

• هدایت ناوبری خودکار (Autonomous Navigation)

• سیستم تشخیص عابر پیاده (Pedestrian Recognition)

• دوربین 360 درجه (360 Degree Camera)

• سیستم روشنایی بین راهی هوشمند (Adaptive Headlamp Assist)

• هشدار خستگی راننده
""",
    articleCar: """
ای کیو ای یا هوش مصنوعی رانندگی در مرسدس بنز به این صورت کار می کند:

• مرسدس بنز از سیستم های سنسورها ، دوربین ها و رادارهایی برای جمع آوری اطلاعات از محیط اطراف خود استفاده می کند. این اطلاعات ورودی برای الگوریتم هوش مصنوعی است.

• نرم افزار هوش مصنوعی قادر است تا ترافیک ، وسایل نقلیه و عابران پیاده را تشخیص دهد و سرعت و مسیر خود را به صورت خودکار تنظیم کند.

• سیستم قادر است شرایط جاده را بررسی کرده و در صورت نیاز سرعت وسیله نقلیه را کاهش دهد.

• این سیستم می تواند به طور خودکار وسیله نقلیه را در مسیر خود نگه دارد و در صورت لزوم ، آن را در مسیر خود بازگرداند.

• سنسورها مستمراً اطلاعات را به روز رسانی می کنند تا سیستم همیشه بروز باشد.

اما به طور کلی، مرسدس-بنز EQC یک خودرو برقی SUV است که با طراحی شیک و زیبا، فناوری پیشرفته و عملکرد قدرتمند معروف است. برخی از ویژگی‌ها و آپشن‌های ممکن در EQC می‌تواند شامل موارد زیر باشد:

سیستم پیشرانش برقی با موتورهای الکتریکی
باتری با ظرفیت بالا و قابلیت شارژ سریع
برد قابل قبول باتری
سیستم انتقال قدرت به چرخ‌ها بر اساس سیستم دو موتور (در سیستم چهار چرخ محرک)
سیستم هوشمند MBUX با نمایشگرهای لمسی
سیستم صوتی با کیفیت بالا
سیستم ناوبری GPS و اتصال به اینترنت
سیستم‌های کنترل خودکار فاصله و کروز کنترل
سیستم پارکینگ خودکار و دوربین‌های ۳۶۰ درجه
سیستم‌های ایمنی پیشرفته، از جمله سیستم‌های کنترل پایداری، سیستم‌های کمک راننده و سیستم‌های تشخیص تصادف.
""",
    id: "9",
  ),
  CarsModel(
    nameCarFA: "جی ال سی",
    nameCarEN: "GLC-SUV",
    classCar: "SUV",
    imgCar: "",
    imgCarPNG: "assets/img/GLS/2022-GLS450-SUV-AVP-DR.png",
    btnRedmore: "more",
    speed: "320",
    power: "255 hp",
    cityFuelEconomy: "25 mpg",
    highwayFuelEconomy: "32 mpg",
    acceleration: "6.2 ثانیه",
    carVideo: "",
    passengerCapacity: "5 نفره",
    engin: "2 سیلندر توربو",
    options: """
1. آپشن‌های رانندگی:
   - سیستم پیشرانش چهار چرخ (4MATIC) برای عملکرد بهتر در شرایط مختلف جاده
   - حالت‌های رانندگی متعدد مانند Comfort، Sport، Eco و Individual

2. سیستم هوشمندی:
   - سیستم هوشمند MBUX با نمایشگرهای لمسی و قابلیت اتصال به اینترنت
   - سیستم صوتی با کیفیت بالا
   - سیستم ناوبری GPS

3. آپشن‌های راحتی و داخلی:
   - صندلی‌های چرمی با قابلیت تنظیم برقی و حافظه
   - سیستم گرمایش و سرمایش صندلی‌ها
   - سیستم پنل‌های شیشه‌ای برقی
   - سیستم سانروف (Sunroof)
   - سیستم پشتیبانی از اتصال بی‌سیم به تلفن همراه (Wireless Phone Charging)
   - سیستم صوتی برند معتبر

4. آپشن‌های ایمنی و تکنولوژی:
   - سیستم‌های کنترل خودکار فاصله (Adaptive Cruise Control)
   - سیستم‌های هشدار تصادف و تشخیص پیاده‌رو (Pedestrian Detection)
   - سیستم‌های کنترل پایداری (Stability Control)
   - سیستم‌های کمک راننده مانند سیستم هشدار خستگی راننده (Driver Attention Alert)
   - سیستم پارکینگ خودکار و دوربین‌های ۳۶۰ درجه
""",
    articleCar: """
جی ال سی (GLC) یکی از محصولات شرکت مرسدس بنز است که در رده خودروهای ون کوچک تولید می‌شود.

اطلاعاتی در مورد جی ال سی:

جی ال سی جانشین خودروی مکان GLC با ابعاد بزرگتر است.

این خودرو با یک موتور بنزینی ۲٫۰ لیتری یا موتور دیزلی ۲٫۱ لیتری عرضه می‌شود.

انتقال قدرت به وسیله یک جعبه‌دنده دستی ۷ سرعته یا یک کلاچ دوکلاچ ۹ سرعته صورت می‌گیرد.

جی ال سی می‌تواند حداکثر تا ۷ نفر ظرفیت حمل مسافر داشته باشد.

این خودرو همچنین دارای تکنولوژی‌ها و امکاناتی همچون دی دبلیو ال (دزدگیر)، ان اس سی، صندلی چرمی و کروز کنترل است.
""",
    id: "10",
  ),
  CarsModel(
    nameCarFA: "میباخ",
    nameCarEN: "Mercedes-Maybach",
    classCar: "شاسی بلند",
    imgCar: "",
    imgCarPNG: "assets/img/Mercedes-Maybach/2021-MAYBACH-GLS-SUV-AVP-DR.png",
    btnRedmore: "more",
    speed: "340",
    power: "550 hp",
    cityFuelEconomy: "15 mpg",
    highwayFuelEconomy: "19 mpg Disclaimer",
    acceleration: "4.8 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my22/gls/maybach/class-page/series/maybach-innovation-hero-video.mp4",
    passengerCapacity: "4 نفره",
    engin: "چهار لیتری - هشت توربو",
    options: """
1. سیستم پیشرانش: 4MATIC (سیستم چهار چرخ متحرک همراه با توانمندی آفرود)، 4MATIC+ (سیستم چهار چرخ متحرک فعال با توانمندی آفرود بهبود یافته).

2. موتور: موتورهای بنزینی V8 4.0 لیتری توربوشارژ، موتورهای هیبریدی (ترکیبی از موتور بنزینی و سیستم الکتریکی).

3. سیستم تعلیق: تعلیق هوای قابل تنظیم با کنترل الکترونیکی، سیستم تعلیق مستقل فشرده.

4. طرح‌های چرم داخلی: چرم ناپا، چرم ناپا با جزییات نقش دار و چرم داخلی طرح "Exclusive Nappa".

5. صندلی‌ها: صندلی‌های جلو با تنظیمات برقی، حافظه و ماساژور، صندلی‌های داخلی براق و صندلی‌های مجهز به سیستم تهویه.

6. سیستم صوتی: سیستم صوتی Burmester 3D Surround Sound با تعداد بلندگوهای بیشتر.

7. تکنولوژی و سرگرمی: نمایشگرهای دیجیتال پیشرفته، سیستم هدآپ، سیستم اطلاعات و سرگرمی COMAND با ناوبری، سیستم کنترل ترافیک بروزرسانی شده، سیستم کنترل لباس‌های گرم و سرد.

8. امکانات ایمنی: سیستم‌های کمک راننده مانند فرمان هوشمند، سیستم تشخیص تصادف، سیستم هشدار خستگی راننده، سیستم کنترل پایداری دینامیکی.

9. سیستم ترمز: سیستم ترمز هیدرولیک کاربن سرامیکی (Carbon Ceramic) که عملکرد ترمزی عالی و مقاومت بالا در برابر گرما را فراهم می‌کند.

10. سیستم تهویه: سیستم تهویه خودکار چهار منطقه‌ای که به هر سرنشین امکان تنظیم دمای مجزا را می‌دهد.

11. پک آپشن AMG: شامل آپشن‌هایی مانند بدنه و آرم‌های طراحی AMG، سیستم تعلیق AMG با کنترل الکترونیکی، سیستم عرضه هوا AMG و سیستم ترمز AMG.

12. سقف شیشه‌ای پانوراما: سقف شیشه‌ای بزرگ که به سرنشینان امکان مشاهده چشمگیر تراچرین را می‌دهد.

13. سیستم سرگرمی پسرانه: سیستم سرگرمی برای مسافران پشتی که شامل نمایشگرهای خلفی، سیستم صوتی برای هر سرنشین و امکانات اتصال به اینترنت می‌شود.

14. سیستم کنترل اعتبار سنجی: سیستم‌های اعتبارسنجی مبتنی بر اثرانگشت و تشخیص چهره برای افزایش امنیت و کنترل دسترسی.

15. سیستم اتوماسیون رانندگی: شامل سیستم‌های هشدار تصادف، سیستم‌های کنترل شتاب خودرو (Cruise Control) و سیستم‌های کمک راننده مانند مانیتورینگ لینی و کنترل پارک.

16. سیستم صوتی Burmester High-End 3D Surround Sound: یک سیستم صوتی حرفه‌ای با تعداد بلندگوهای بیشتر، ساب‌ووفر، و تکنولوژی صوتی 3D.
""",
    articleCar: """
میباخ شاسی بلند مرسدس بنز یک خودروی لوکس و بسیار قدرتمند است که توسط شرکت مرسدس بنز تولید می‌شود. این خودرو در دسته‌بندی شاسی بلند قرار می‌گیرد و برای عملکرد خارج از جاده و سفرهای سخت طراحی شده است.

میباخ شاسی بلند به عنوان یکی از پر طرفدارترین خودروهای لوکس جهان شناخته می‌شود. این خودرو دارای طراحی شگفت‌انگیزی است که ترکیبی از استحکام، شکوه و زیبایی را به ارمغان می‌آورد. طراحی خارجی میباخ شاسی بلند بسیار جذاب و اسپرت است و با جزئیات لوکس مانند نورپردازی LED، گریل بزرگ، و جعبه دنده‌های کروم‌پوش متناسب است.

در مورد عملکرد، میباخ شاسی بلند با استفاده از موتورهای بسیار قوی و پیشرانه‌های پیشرفته از نظر تکنولوژی، توانسته است عملکردی فوق‌العاده ارائه دهد. این خودرو مجهز به سیستم‌های پیشرانش 4WD (چهار چرخ متحرک) است که قدرت و کنترل بیشتری را در شرایط سخت مانند آفرود و زمین‌های ناهموار فراهم می‌کند.

در داخل خودرو، میباخ شاسی بلند با تجهیزات و امکانات لوکس پر شده است. داخلی آن با استفاده از مصالح با کیفیت بالا و طراحی زیبا، فضایی راحت و لوکس را برای سرنشینان خلق می‌کند. امکاناتی مانند صندلی‌های چرمی، سیستم صوتی فوق‌العاده، سیستم ناوبری پیشرفته و تکنولوژی‌های ارتباطی مدرن در این خودرو وجود دارد.

میباخ شاسی بلند از نظر قیمتی یکی از خودروهای بسیار گرانقیمت است و معمولاً به عنوان نمادی از توانمندی و استثنایی بودن در دسته خود شناخته می‌شود.
""",
    id: "11",
  ),
  CarsModel(
    nameCarFA: "ای کلاس",
    nameCarEN: "E-class",
    classCar: "sedan",
    imgCar: "",
    imgCarPNG: "assets/img/E-class/2022-E350-SEDAN-AVP-DR.png",
    btnRedmore: "more",
    speed: "320",
    power: "255 hp",
    cityFuelEconomy: "23 mpg",
    highwayFuelEconomy: "31 mpg",
    acceleration: "6.1 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my22/e/sedan/class-page/series/2022-E-SEDAN-CT-2-2-DR.mp4",
    passengerCapacity: "5 نفره",
    engin: "دو سیلندر و چهار توربو",
    options: """
1. سیستم هشدار تصادف
2. سیستم کنترل پارک
3. دوربین های 360 درجه
4. سیستم ناوبری
5. سیستم صوتی Burmester
6. سیستم تهویه خودکار چند منطقه‌ای
7. سیستم تعلیق هوشمند
8. سقف شیشه‌ای پانوراما
9. صندلی‌های جلو با گرمایش و تهویه
10. صندلی‌های ماساژور
11. سیستم صوتی Surround Sound
12. سیستم اتوماسیون رانندگی
13. سیستم تشخیص تشت تایر
14. سیستم تشخیص خستگی راننده
15. سیستم اعلان ترافیک
16. سیستم تشخیص نقاط کور
17. سیستم کنترل اعتبار سنجی
18. سیستم ترمز هیدرولیک کاربن سرامیکی
19. سیستم اعلان خروج از مسیر
20. سیستم هدایت خودکار
""",
    articleCar: """
ای کلاس مرسدس بنز یک خودروی لوکس و ویژه است که توسط شرکت مرسدس بنز تولید می‌شود. این خودرو در دسته بندی خودروهای سدان لوکس قرار می‌گیرد و توجه زیادی به جزئیات طراحی، کیفیت ساخت و امکانات راحتی و تکنولوژی دارد. در زیر به برخی از ویژگی‌ها و امکانات ای کلاس مرسدس بنز اشاره می‌کنم:

طراحی بیرونی: ای کلاس دارای طراحی شیک و الگانت است که با خطوط آرمانیک و جزئیات زیبا متمایز می‌شود. از جنس آلومینیوم و فولاد استفاده شده است تا وزن را کاهش داده و سختی و استحکام را افزایش دهد.

داخلی: داخل ای کلاس با استفاده از مواد با کیفیت بالا ساخته شده است. صندلی‌های چرمی راحت و قابل تنظیم، سیستم تهویه خودکار دو منطقه‌ای، سیستم صوتی با کیفیت بالا و فضای بزرگ برای سرنشینان عناصری از امکانات داخلی ای کلاس مرسدس بنز هستند.

تکنولوژی و سرگرمی: ای کلاس مجهز به سیستم نمایشگر دیجیتال بزرگ است که امکانات ناوبری، سیستم صوتی، اطلاعات رانندگی و اتصال به تلفن همراه را فراهم می‌کند. همچنین، سیستم هشدار تصادف، سیستم کنترل پارک و دوربین های لنز وسیع از دیگر امکانات تکنولوژیکی این خودرو هستند.

ایمنی: ای کلاس مجهز به سیستم‌های پیشرانه مانند سیستم تشخیص تصادف، سیستم کنترل پایداری دینامیکی و سیستم هشدار خستگی راننده است. همچنین، ساختار بدنه مقاوم و سیستم ترمز قوی ای کلاس به افزایش ایمنی رانندگی کمک می‌کند.

گزینه‌های موتوری: ای کلاس مرسدس بنز در نسخه‌های مختلف با موتورهای مختلف عرضه می‌شود. این شامل موتورهای بنزینی و دیزل با توان و عملکرد مختلف است.
""",
    id: "12",
  ),
  CarsModel(
    nameCarFA: "جی ال ای",
    nameCarEN: "GLE",
    classCar: "کوپه",
    imgCar: "",
    imgCarPNG: "assets/img/GLE/2022-AMG-GLE53-COUPE-AVP-DR.png",
    btnRedmore: "مشاهده",
    speed: "340",
    power: "",
    cityFuelEconomy: "",
    highwayFuelEconomy: "",
    acceleration: "",
    carVideo: "",
    passengerCapacity: "",
    engin: "",
    options: """
سیستم تعلیق هوای اداپتیو: این سیستم باعث می‌شود سیستم تعلیق خود را با شرایط جاده تطبیق دهد.

بسته AMG: شامل ارتقاءات ظاهری و عملکردی مانند اگزوز ورزشی، لمسات ظاهری ویژه و غیره.

سقف پانوراما: سقف شیشه ای بزرگ که منظره بیشتری را فراهم می‌کند.

صندلی‌های عقب تاشو و گرم

سیستم صوتی بانگ اند اولوفسن با سیستم صوتی مارپیچ

دوربین دید عقب، دوربین 360 درجه

کروز کنترل اداپتیو

بسته دستیار راننده

-سیستم ناوبری مبتنی بر سخت افزار

شارژر بی‌سیم تلفن همراه

سیستم کمک پارک خودکار
بسته ظاهری Night Package - شامل جزئیات ظاهری تیره رنگ مانند چراغ های جلو و عقب تیره رنگ و غیره

بسته داخلی Exclusive Interior - شامل مواد با کیفیت تر مانند چوب طبیعی، الیاف کربن و چرم نرم

بسته Offroad - شامل ویژگی‌هایی برای رانندگی در جاده‌های ناهموار مانند سیستم تعلیق تنظیم‌پذیر

سیستم صوتی Burmester با 19 بلندگو و 1580 وات قدرت

سقف مادون قرمز - کاهش انتقال گرمای خورشید

درب صندوق عقب برقی

صندلی جلو تهویه و ماساژ

چراغ‌های LED جلو و عقب

فرمان دوگانه

شیشه‌های عایق صدا
""",
    articleCar: """
جی ال ای یکی از محبوب‌ترین و لوکس‌ترین خودروهای مرسدس بنز است که از سال 1997 تاکنون تولید شده است.

این خودرو در کلاس خودروهای شاسی بلند قرار دارد و رقیب اصلی آن BMW X5 می‌باشد.

جی ال ای در دو نسل عرضه شده است. نسل اول از 1997 تا 2005 و نسل دوم از 2006 تاکنون.

موتورهای این خودرو از موتورهای V6 و V8 بنزینی تا موتورهای دیزلی را شامل می‌شود.

قدرت موتور در مدل‌های مختلف بین 272 تا 6

جی ال ای مجهز به سیستم دندهٔ اتوماتیک 7 سرعته و سیستم حرکت در همه جهات می‌باشد.

از ویژگی‌های این خودرو می‌توان به طراحی زیبا، راحتی عالی، کیفیت بالا و عملکرد توانمند آن اشاره کرد.
""",
    id: "13",
  ),
  CarsModel(
    nameCarFA: "اِی کلاس",
    nameCarEN: "A-class",
    classCar: "sedan",
    imgCar: "",
    imgCarPNG: "assets/img/A-class/2022-A220-SEDAN-AVP-DR.png",
    btnRedmore: "more",
    speed: "340",
    power: "188 hp",
    cityFuelEconomy: "24 mpg",
    highwayFuelEconomy: "35 mpg",
    acceleration: "7.1 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my22/a/class-page/series/2022-A-SEDAN-CT-1-5-DR.mp4",
    passengerCapacity: "5 نفره",
    engin: "دو سیلندر و چهار توربو",
    options: """
1. سیستم ناوبری: یک سیستم ناوبری کامل با نمایشگر گسترده و راهنمای صوتی.

2. سیستم صوتی برمستر: یک سیستم صوتی پیشرفته با بلندگوهای با کیفیت بالا و تجربه صوتی فوق العاده.

3. سیستم هشدار تصادف: سیستم هشدار و جلوگیری از تصادف با استفاده از سنسورها و دوربین‌های جلو.

4. سیستم تشخیص خستگی راننده: سیستمی که با تشخیص علائم خستگی راننده، هشدار می‌دهد.

5. سیستم تشخیص نقاط کور: یک سیستم که با استفاده از سنسورها، نقاط کور در فضای پیرامون خودرو را تشخیص می‌دهد.

6. سیستم پارک خودکار: امکان پارک خودکار خودرو با استفاده از سنسورها و کنترل‌های خودکار.

7. سیستم کنترل سرعت هوشمند: سیستمی که به صورت خودکار فاصله‌گیری و کنترل سرعت خودرو را تنظیم می‌کند.

8. سیستم هشدار ترافیک متقاطع: سیستمی که با استفاده از دوربین‌ها و سنسورها، هشدار می‌دهد در صورت حضور خطر در ترافیک متقاطع.

9. سیستم هشدار خروج از مسیر: سیستمی که هشدار می‌دهد در صورت خروج از مسیر خودرو از محدوده مشخصی.

10. سیستم کنترل ترمز عقب: سیستمی که با کمک سنسورها و کنترل‌های خودکار، ترمز عقب را کنترل می‌کند تا برخورد را جلوگیری کند.
""",
    articleCar: """
ماشین A-Class از مرسدس بنز یک خودرو کوچک و ورودی سطح بالا است که برای جذب مشتریان جوان و خریدارانی که به دنبال یک خودرو کوچک و شیک هستند طراحی شده است.
طراحی شیک: ماشین A-Class دارای طراحی جذاب و مدرن با خطوط داینامیکی و ظاهر جذاب می‌باشد.

سیستم اطلاعات و سرگرمی: مجهز به سیستم MBUX (Mercedes-Benz User Experience) که شامل صفحه نمایش لمسی بزرگ و هوشمند، پشتیبانی از اتصال بی‌سیم به گوشی همراه، ناوبری، سیستم صوتی برمستر و قابلیت کنترل صوتی است.

امکانات ایمنی: شامل سیستم هشدار تصادف، سیستم تشخیص نقاط کور، سیستم تشخیص خستگی راننده، سیستم هشدار ترافیک متقاطع و سیستم تشخیص تشت تایر می‌باشد.

سیستم تعلیق: مجهز به سیستم تعلیق راحت و کارآمد برای تجربه رانندگی بهتر و کمترین ارتعاشات و لغزش در جاده های نامساعد.

گزینه‌های قدرت موتور: ماشین A-Class با موتورهای متنوعی عرضه می‌شود، از جمله موتورهای بنزینی و دیزل با توان‌ها و نیروهای مختلف.

سیستم‌های کمکی به راننده: شامل سیستم کنترل پارک، سیستم هدایت خودکار، سیستم کنترل سرعت هوشمند و سیستم هشدار خروج از مسیر می‌باشد.

داخلی شیک و کیفیت ساخت بالا: داخلی ماشین A-Class با استفاده از مواد با کیفیت بالا و طراحی مینیمالیستی طراحی شده است. صندلی‌های راحت و فضای داخلی مناسب از ویژگی‌های آن است.

امکانات تفریحی: امکاناتی مانند سیستم صوتی پریمیوم، اتصال بلوتوث و USB، درگاه‌های شارژ و قابلیت اتصال به Apple CarPlay و Android Auto در دسترس هستند.
""",
    id: "14",
  ),
  CarsModel(
    nameCarFA: "کیو اس",
    // nameCarFA: "ای کیو اس",
    nameCarEN: "EQS-Sedan",
    classCar: "sedan",
    imgCar: "",
    imgCarPNG: "assets/img/EQS/2023-EQS450-SUV-AVP-DR.png",
    btnRedmore: "more",
    speed: "340",
    power: "355 hp",
    cityFuelEconomy: "24 mpg",
    highwayFuelEconomy: "35 mpg",
    acceleration: "6.5 ثانیه",
    carVideo:
        "https://www.mbusa.com/content/dam/mb-nafta/us/myco/my22/a/class-page/series/2022-A-SEDAN-CT-1-5-DR.mp4",
    passengerCapacity: "5 نفره",
    engin: "برقی",
    options: """
1. MBUX Hyperscreen: سیستم نمایشگر بزرگ و منحنی که اطلاعات و کنترل‌های مختلف را در یک صفحه نمایش می‌دهد.

2. سیستم صوتی Burmester 3D: یک سیستم صوتی با کیفیت بالا و صدای سه بعدی.

3. سیستم همراهی راننده (Driver Assistance Package): شامل سیستم‌های مختلفی از جمله برنامه ریزی سفر، تشخیص ترافیک و خریداری خودکار، هشدار تصادف و کنترل سرعت هوشمند است.

4. سیستم خودران‌سازی (Automated Driving Package): شامل قابلیت‌های خودران‌سازی سطح 3 که به ماشین اجازه می‌دهد در شرایط خاص و بر روی بزرگراه‌ها به طور خودکار رانندگی کند.

5. سیستم هوشمند پارک (Intelligent Park Pilot): یک سیستم کمک به راننده برای پارک خودکار در مکان‌های محدود.

6. سیستم عیب‌یابی خودکار (Predictive Maintenance System): سیستمی که با استفاده از داده‌های خودرو، قادر است عیب‌های محتمل را پیش بینی و به راننده اطلاع دهد.

7. پنجره‌های جانبی بازشو: پنجره‌های جانبی خودکار که به صورت اتوماتیک باز و بسته می‌شوند.

8. سیستم کنترل خودکار دما (Automatic Climate Control): یک سیستم کنترل هوشمند که به طور خودکار دما و سیستم گرمایش/سرمایش را تنظیم می‌کند.

9. سیستم ناوبری MBUX: یک سیستم ناوبری پیشرفته با صفحه نمایش بزرگ، نقشه‌های آنلاین و قابلیت اتصال به گوشی همراه.

10. سیستم تصفیه هوا: یک سیستم تصفیه هوا با فیلترهای بالا برای حفظ کیفیت هوای داخل خودرو.

11. سیستم شارژ بی‌سیم: امکان شارژ بی‌سیم گوشی همراه در داخل خودرو.

12. سیستم هشدار تصادف: یک سیستم هشدار و جلوگیری از تصادف با استفاده از سنسورها و داده‌های خودرو.

13. سیستم تشخیص خط جاده: یک سیستم که خطوط جاده را تشخیص داده و به راننده کمک می‌کند در مسیر صحیح حرکت کند.

14. سیستم اعببخشید، اما به دلیل محدودیت طول متن در این پلتفرم، نمی‌توانم آپشن‌های بیشتری را برای شما لیست کنم. اما مطمئناً ماشین EQS مرسدس بنز دارای بسیاری از آپشن‌ها و قابلیت‌های جذاب دیگری است که می‌تواند تجربه رانندگی را بهبود بخشد.
""",
    articleCar: """
با افتخار! ای‌کیو‌اس (EQS) مرسدس بنز یک خودرو الکتریکی لوکس و پیشرفته است که به عنوان پرچمدار برند مرسدس بنز در خط محصولات الکتریکی EQ معرفی شده است. ای‌کیو‌اس با استفاده از فناوری‌های نوآورانه و طراحی زیبا، تجربه رانندگی الکتریکی پیشرفته را ارائه می‌دهد. در زیر، برخی از ویژگی‌ها و آپشن‌های قابل توجه در ای‌کیو‌اس مرسدس بنز ذکر شده است:

1. طراحی زیبا: ای‌کیو‌اس دارای طراحی منحصر به فرد و زیبا با خطوط جریانی و آرمانیک است. طراحی شاسی کاملاً الکتریکی و استفاده از مواد با کیفیت بالا به منظور بهبود کارایی و کاهش مصرف انرژی.

2. سیستم پرقدرت: ای‌کیو‌اس با موتورهای الکتریکی قدرتمند و سیستم باتری بزرگ، قدرت و عملکرد بالا را ارائه می‌دهد. مدل‌های مختلف با نیروی موتور و برد متفاوت در دسترس هستند.

3. باتری بزرگ: ای‌کیو‌اس با باتری بزرگ و قدرتمند به راحتی می‌تواند مسافت‌های بلند را با یک بار شارژ طی کند. همچنین، ای‌کیو‌اس از سیستم شارژ سریع پشتیبانی می‌کند که به شما امکان شارژ سریع در ایستگاه‌های شارژ عمومی را می‌دهد.

4. سیستم اطلاعات و سرگرمی: مجهز به سیستم MBUX Hyperscreen که یک نمایشگر بزرگ و منحنی است که از یک کنترل کننده هوشمند برای کنترل انواع عملکردها و اطلاعات استفاده می‌کند. همچنین، ای‌کیو‌اس دارای اتصال بی‌سیم به گوشی همراه، ناوبری پیشرفته و سیستم صوتی با کیفیت بالا است.

5. امکانات ایمنی پیشرفته: ای‌کیو‌اس شامل سیستم‌های هشدار تصادف، کنترل پیشرفته استرس راننده، سیستم کنترل پیشرفته پارک، سیستم کمک به راننده در رانندگی در شهر و سیستم‌های تشخیص خط‌های جاده می‌باشد.

6. فضای داخلی لوکس: داخلی ای‌کیو‌اس با استفاداز مواد با کیفیت بالا و طراحی لوکس، ارگونومیک و زیبا ساخته شده است. صندلی‌های فوق العاده راحت و قابل تنظیم، سیستم چراغ‌های آمبینت، سیستم گرمایش و سرمایش هوشمند و سایر امکانات راحتی و لوکس در دسترس هستند.

7. سیستم همراهی راننده: ای‌کیو‌اس مجهز به سیستم همراهی راننده است که شامل سیستم‌های تشخیص ترافیک، نمایش سرعت و دستورات رانندگی، هشدارهای تصادف و سایر اطلاعات مربوط به رانندگی است.

8. خودران‌سازی: ای‌کیو‌اس دارای قابلیت خودران‌سازی سطح 3 است که به اتوماسیون بالایی در رانندگی بر روی بزرگراه‌ها و در شرایط خاص اجازه می‌دهد.

9. طراحی بهینه‌شده برای کارایی انرژی: با استفاده از طراحی بدنه و شاسی بهینه و استفاده از فناوری‌های مدیریت انرژی پیشرفته، ای‌کیو‌اس از کارایی انرژی بالا و برد بزرگ برخوردار است.

10. اتصال به شبکه: ای‌کیو‌اس از امکانات اتصال به شبکه پشتیبانی می‌کند، از جمله اتصال به اینترنت، به‌روزرسانی نرم‌افزارها به‌صورت بی‌سیم و دسترسی به خدمات آنلاین مرسدس بنز.
""",
    id: "15",
  ),
];
